export { iosProvinces ,iosCitys, iosCountys}
// 省份列表
var iosProvinces = [
    /*******首都核心区********/
    {'id': '1100000', 'value': '东城区', 'parentId': '0'},
    {'id': '1200000', 'value': '西城区', 'parentId': '0'},
    /*******中心城区********/
    {'id': '1300000', 'value': '朝阳区', 'parentId': '0'},
    {'id': '1400000', 'value': '海淀区', 'parentId': '0'},
    {'id': '1500000', 'value': '丰台区', 'parentId': '0'},
    {'id': '2100000', 'value': '石景山区', 'parentId': '0'},
    /*******发展********/
    {'id': '2200000', 'value': '昌平区', 'parentId': '0'},
    {'id': '2300000', 'value': '大兴区', 'parentId': '0'},
    {'id': '3100000', 'value': '房山区', 'parentId': '0'},
    {'id': '3200000', 'value': '顺义区', 'parentId': '0'},
    {'id': '3300000', 'value': '通州区', 'parentId': '0'},
    /*******生态涵养区********/
    {'id': '3400000', 'value': '怀柔区', 'parentId': '0'},
    {'id': '3500000', 'value': '门头沟区', 'parentId': '0'},
    {'id': '3600000', 'value': '密云区', 'parentId': '0'},
    {'id': '3700000', 'value': '平谷区', 'parentId': '0'},
    {'id': '4100000', 'value': '延庆区', 'parentId': '0'}
];

// 公司列表
var iosCitys = [
    /**********东城区公司********/
    {"id":"1100100","value":"东城环卫","parentId":"1100000"},
    {"id":"1100200","value":"东城电力","parentId":"1100000"},
    {"id":"1100300","value":"东城燃气","parentId":"1100000"},
    {"id":"1100400","value":"东城教育","parentId":"1100000"},
    {"id":"1100500","value":"东城医疗","parentId":"1100000"},
    {"id":"1100600","value":"东城供水","parentId":"1100000"},

    /**********西城区公司********/
    {"id":"1200100","value":"西城移动","parentId":"1200000"},
    {"id":"1200200","value":"西城联通","parentId":"1200000"},
    {"id":"1200300","value":"西城电信","parentId":"1200000"},
    {"id":"1200400","value":"西城国美","parentId":"1200000"},
    {"id":"1200500","value":"西城苏宁","parentId":"1200000"},
    {"id":"1200600","value":"西城京东","parentId":"1200000"},

    /**********朝阳区公司********/
    {"id":"1300100","value":"朝阳移动","parentId":"1300000"},
    {"id":"1300200","value":"朝阳联通","parentId":"1300000"},
    {"id":"1300000","value":"朝阳电信","parentId":"1300000"},
    {"id":"1300400","value":"朝阳国美","parentId":"1300000"},
    {"id":"1300500","value":"朝阳苏宁","parentId":"1300000"},
    {"id":"1399900","value":"朝阳京东","parentId":"1300000"},

    /**********海淀区公司********/
    {"id":"1400100","value":"海淀太原市","parentId":"1400000"},
    {"id":"1400200","value":"海淀大同市","parentId":"1400000"},
    {"id":"1400300","value":"海淀阳泉市","parentId":"1400000"},
    {"id":"1400400","value":"海淀长治市","parentId":"1400000"},
    {"id":"1400500","value":"海淀晋城市","parentId":"1400000"},
    {"id":"1499900","value":"海淀朔州市","parentId":"1400000"},
   
    /**********丰台区公司********/
    {"id":"1500100","value":"丰台呼和浩特市","parentId":"1500000"},
    {"id":"1500200","value":"丰台包头市","parentId":"1500000"},
    {"id":"1500300","value":"丰台乌海市","parentId":"1500000"},
    {"id":"1500400","value":"丰台赤峰市","parentId":"1500000"},
    {"id":"1500500","value":"丰台通辽市","parentId":"1500000"},
    {"id":"1599900","value":"丰台鄂尔多斯市","parentId":"1500000"},

    /**********石景山区公司********/
    {"id":"2100100","value":"石景山沈阳市","parentId":"2100000"},
    {"id":"2100200","value":"石景山大连市","parentId":"2100000"},
    {"id":"2100300","value":"石景山鞍山市","parentId":"2100000"},
    {"id":"2100400","value":"石景山抚顺市","parentId":"2100000"},
    {"id":"2100500","value":"石景山本溪市","parentId":"2100000"},
    {"id":"2199900","value":"石景山丹东市","parentId":"2100000"},
 
    /**********昌平区公司*********/
    {"id":"2200100","value":"昌平长春市","parentId":"2200000"},
    {"id":"2200200","value":"昌平吉林市","parentId":"2200000"},
    {"id":"2200300","value":"昌平四平市","parentId":"2200000"},
    {"id":"2200400","value":"昌平辽源市","parentId":"2200000"},
    {"id":"2200500","value":"昌平通化市","parentId":"2200000"},
    {"id":"2299900","value":"昌平延边朝鲜族自治州","parentId":"2200000"},

    /**********大兴区公司********/
    {"id":"2300100","value":"大兴哈尔滨市","parentId":"2300000"},
    {"id":"2300200","value":"大兴齐齐哈尔市","parentId":"2300000"},
    {"id":"2300300","value":"大兴鸡西市","parentId":"2300000"},
    {"id":"2300400","value":"大兴鹤岗市","parentId":"2300000"},
    {"id":"2300500","value":"大兴双鸭山市","parentId":"2300000"},
    {"id":"2399900","value":"大兴大兴安岭地区","parentId":"2300000"},

    /**********房山区公司********/
    {"id":"3100100","value":"房山联通","parentId":"3100000"},
    {"id":"3100200","value":"房山移动","parentId":"3100000"},
    {"id":"3100300","value":"房山电信","parentId":"3100000"},
    {"id":"3100400","value":"房山物美","parentId":"3100000"},
    {"id":"3100500","value":"房山超市发","parentId":"3100000"},
    {"id":"3199900","value":"房山沃尔玛会员店","parentId":"3100000"},

    /**********顺义区公司********/
    {"id":"3200100","value":"顺义南京市","parentId":"3200000"},
    {"id":"3200200","value":"顺义无锡市","parentId":"3200000"},
    {"id":"3200300","value":"顺义徐州市","parentId":"3200000"},
    {"id":"3200400","value":"顺义常州市","parentId":"3200000"},
    {"id":"3200500","value":"顺义苏州市","parentId":"3200000"},
    {"id":"3299900","value":"顺义南通市","parentId":"3200000"},

    /**********通州区公司********/
    {"id":"3300100","value":"通州杭州市","parentId":"3300000"},
    {"id":"3300200","value":"通州宁波市","parentId":"3300000"},
    {"id":"3300300","value":"通州温州市","parentId":"3300000"},
    {"id":"3300400","value":"通州嘉兴市","parentId":"3300000"},
    {"id":"3300500","value":"通州湖州市","parentId":"3300000"},
    {"id":"3399900","value":"通州绍兴市","parentId":"3300000"},

    /**********怀柔区公司********/
    {"id":"3400100","value":"怀柔合肥市","parentId":"3400000"},
    {"id":"3400200","value":"怀柔芜湖市","parentId":"3400000"},
    {"id":"3400300","value":"怀柔蚌埠市","parentId":"3400000"},
    {"id":"3400400","value":"怀柔淮南市","parentId":"3400000"},
    {"id":"3400500","value":"怀柔马鞍山市","parentId":"3400000"},
    {"id":"3499900","value":"怀柔淮北市","parentId":"3400000"},

    /**********门头沟区公司********/
    {"id":"3500100","value":"门头沟福州市","parentId":"3500000"},
    {"id":"3500200","value":"门头沟厦门市","parentId":"3500000"},
    {"id":"3500300","value":"门头沟莆田市","parentId":"3500000"},
    {"id":"3500400","value":"门头沟三明市","parentId":"3500000"},
    {"id":"3500500","value":"门头沟泉州市","parentId":"3500000"},
    {"id":"3500600","value":"门头沟漳州市","parentId":"3500000"},
    {"id":"3500700","value":"门头沟南平市","parentId":"3500000"},
    {"id":"3500800","value":"门头沟龙岩市","parentId":"3500000"},
    {"id":"3599900","value":"门头沟宁德市","parentId":"3500000"},

    /**********密云区公司********/
    {"id":"3600100","value":"密云南昌市","parentId":"3600000"},
    {"id":"3600200","value":"密云景德镇市","parentId":"3600000"},
    {"id":"3600300","value":"密云萍乡市","parentId":"3600000"},
    {"id":"3600400","value":"密云九江市","parentId":"3600000"},
    {"id":"3600500","value":"密云新余市","parentId":"3600000"},
    {"id":"3600600","value":"密云鹰潭市","parentId":"3600000"},
    {"id":"3600700","value":"密云赣州市","parentId":"3600000"},
    {"id":"3600800","value":"密云吉安市","parentId":"3600000"},
    {"id":"3600900","value":"密云宜春市","parentId":"3600000"},
    {"id":"3601000","value":"密云抚州市","parentId":"3600000"},
    {"id":"3699900","value":"密云上饶市","parentId":"3600000"},

    /**********平谷区公司********/
    {"id":"3700100","value":"平谷济南市","parentId":"3700000"},
    {"id":"3700200","value":"平谷青岛市","parentId":"3700000"},
    {"id":"3700300","value":"平谷淄博市","parentId":"3700000"},
    {"id":"3700400","value":"平谷枣庄市","parentId":"3700000"},
    {"id":"3700500","value":"平谷东营市","parentId":"3700000"},
    {"id":"3700600","value":"平谷烟台市","parentId":"3700000"},
    {"id":"3700700","value":"平谷潍坊市","parentId":"3700000"},
    {"id":"3700800","value":"平谷济宁市","parentId":"3700000"},
    {"id":"3700900","value":"平谷泰安市","parentId":"3700000"},
    {"id":"3701000","value":"平谷威海市","parentId":"3700000"},
    {"id":"3701100","value":"平谷日照市","parentId":"3700000"},
    {"id":"3701200","value":"平谷莱芜市","parentId":"3700000"},
    {"id":"3701300","value":"平谷临沂市","parentId":"3700000"},
    {"id":"3701400","value":"平谷德州市","parentId":"3700000"},
    {"id":"3701500","value":"平谷聊城市","parentId":"3700000"},
    {"id":"3701600","value":"平谷滨州市","parentId":"3700000"},
    {"id":"3799900","value":"平谷菏泽市","parentId":"3700000"},

    /**********延庆区公司********/
    {"id":"4100100","value":"延庆郑州市","parentId":"4100000"},
    {"id":"4100200","value":"延庆开封市","parentId":"4100000"},
    {"id":"4100300","value":"延庆洛阳市","parentId":"4100000"},
    {"id":"4100400","value":"延庆平顶山市","parentId":"4100000"},
    {"id":"4100500","value":"延庆安阳市","parentId":"4100000"},
    {"id":"4100600","value":"延庆鹤壁市","parentId":"4100000"},
    {"id":"4100700","value":"延庆新乡市","parentId":"4100000"},
    {"id":"4100800","value":"延庆焦作市","parentId":"4100000"},
    {"id":"4100900","value":"延庆濮阳市","parentId":"4100000"},
    {"id":"4101000","value":"延庆许昌市","parentId":"4100000"},
    {"id":"4101100","value":"延庆漯河市","parentId":"4100000"},
    {"id":"4101200","value":"延庆三门峡市","parentId":"4100000"},
    {"id":"4101300","value":"延庆南阳市","parentId":"4100000"},
    {"id":"4101400","value":"延庆商丘市","parentId":"4100000"},
    {"id":"4101500","value":"延庆信阳市","parentId":"4100000"},
    {"id":"4101600","value":"延庆周口市","parentId":"4100000"},
    {"id":"4199900","value":"延庆驻马店市","parentId":"4100000"},

                  /**测试预留**/   
    {"id":"9999900","value":"测试预留","parentId":"9900000"}

];

// 区县列表
var iosCountys = [
    /*
    /**********北京市********/
    {"id":"110101","value":"东城区","parentId":"110100"},
    {"id":"110102","value":"西城区","parentId":"110100"},
  
    /**********天津市********/
    {"id":"120101","value":"和平区","parentId":"120100"},
    {"id":"120102","value":"河东区","parentId":"120100"},
   
    /**********石家庄市********/
    {"id":"130102","value":"长安区","parentId":"130100"},
    {"id":"130103","value":"桥东区","parentId":"130100"},
  
    /**********太原市********/
    {"id":"140105","value":"小店区","parentId":"140100"},
    {"id":"140106","value":"迎泽区","parentId":"140100"},
  
    /**********呼和浩特市********/
    {"id":"150102","value":"新城区","parentId":"150100"},
    {"id":"150103","value":"回民区","parentId":"150100"},
  
    {"id":"659004","value":"五家渠市","parentId":"659004"}
    
];

